Software Wrike is described as Wrike's human resources software is used by more than 20,000 companies across 140 countries. Plan, manage, and report on your HR projects with Wrike's easy-to-use HR software. Keep track of recruitment, payment, onboarding, and management using ready-made templates, powerful workflows, and shared team dashboards. Automate your HR processes using approvals and requests. Enable your teams to share and check real-time updates. Start your free trial now..Features included: Human Resources, Account Based Marketing, All-in-One Marketing Platform, Application Lifecycle Management, Brand Management, Bug Tracking, Business Plan, Calendar, Change Management, Cloud Communication Platform, Contact Management, Content Management, Content Marketing, Dashboard, Demand Planning, DevOps, Digital Asset Management, Digital Workplace, Display Advertising, EAM, Email Marketing, Employee Communication Tools, Enterprise Architecture, Enterprise Content Management, Enterprise Resource Planning, Entity Management, Event Management, Event Marketing, File Sharing, Financial Management, Financial Reporting, Financial Risk Management, Fixed Asset Management, Forms Automation, IT Service, IWMS, Idea Management, Instant Messaging & Chat, Internal Communications, Issue Tracking, Kanban Tools, Legal Calendar, Legal Case Management, Log Management, Marketing Analytics, Marketing Attribution, Marketing Automation, Onboarding, Online Proofing, Performance Management System, Production Scheduling, Productivity, Punch List, Real Estate Agency, Remote Support, Remote Work, Reporting, Requirements Management, Small Business Marketing, Social Media Analytics Tools, Social Media Marketing, Spend Management, Strategic Planning, Team Communication, Time Clock, Time Tracking, Time and Expense, Video Marketing, Work Order. Pricing described as FREE: Wrike's FREE basic plan is now available for unlimited users. 
Professional: $9.80 per user/month
Business: $24.80 per user/month billed annually
Enterprise: $45 per user/month. To receive accurate pricing, contact Wrike directly.
Pinnacle: $60 per user/month. To receive accurate pricing, contact Wrike directly. and a target audience Perfect fit for Mid-sized and Enterprise companies that embrace teamwork, run multiple projects, & clients. Tailor Wrike to your needs with custom workflows, fields, & reports. 